#ifndef VERTICES_H
#define VERTCES_H

//координаты вершин прямоугольника для текстуры + координаты текстуры
float verticesOriginal[] = {
	 1.0f,  1.0f, 0.0f,   1.0f, 0.0f, // верхний правый угол
	 1.0f, -1.0f, 0.0f,   1.0f, 1.0f, // нижний правый угол
	-1.0f, -1.0f, 0.0f,   0.0f, 1.0f, // нижний левый угол
	-1.0f,  1.0f, 0.0f,   0.0f, 0.0f  // верхний левый угол
};

//уменьшенное изображение в левом веррхнем углу
float verticesSmall[] = {
	 0.0f,  1.0f, 0.0f,  1.0f, 0.0f, // верхний край
	 0.0f,  0.0f, 0.0f,  1.0f, 1.0f, // центр
	-1.0f,  0.0f, 0.0f,  0.0f, 1.0f, // левый край
	-1.0f,  1.0f, 0.0f,  0.0f, 0.0f, // верхний левый угол
};

float verticesHalf1[] = {
	 0.0f,  1.0f, 0.0f,	 1.0f, 0.0f,
	 0.0f, -1.0f, 0.0f,	 1.0f, 1.0f,
	-1.0f, -1.0f, 0.0f,	 0.0f, 1.0f,
	-1.0f,  1.0f, 0.0f,	 0.0f, 0.0f
};

float verticesHalf2[] = {
	1.0f,  1.0f, 0.0f,	0.0f, 0.0f,
	1.0f, -1.0f, 0.0f,	0.0f, 1.0f,
	0.0f, -1.0f, 0.0f,	1.0f, 1.0f,
	0.0f,  1.0f, 0.0f,	1.0f, 0.0f
};

float cubeVertices[] = {
    -0.5f, -0.5f, -0.5f,  0.0f, 1.0f,
     0.5f, -0.5f, -0.5f,  1.0f, 1.0f,
     0.5f,  0.5f, -0.5f,  1.0f, 0.0f,
     0.5f,  0.5f, -0.5f,  1.0f, 0.0f,
    -0.5f,  0.5f, -0.5f,  0.0f, 0.0f,
    -0.5f, -0.5f, -0.5f,  0.0f, 1.0f,

    -0.5f, -0.5f,  0.5f,  0.0f, 1.0f,
     0.5f, -0.5f,  0.5f,  1.0f, 1.0f,
     0.5f,  0.5f,  0.5f,  1.0f, 0.0f,
     0.5f,  0.5f,  0.5f,  1.0f, 0.0f,
    -0.5f,  0.5f,  0.5f,  0.0f, 0.0f,
    -0.5f, -0.5f,  0.5f,  0.0f, 1.0f,

    -0.5f,  0.5f,  0.5f,  1.0f, 0.0f,
    -0.5f,  0.5f, -0.5f,  1.0f, 1.0f,
    -0.5f, -0.5f, -0.5f,  0.0f, 1.0f,
    -0.5f, -0.5f, -0.5f,  0.0f, 1.0f,
    -0.5f, -0.5f,  0.5f,  0.0f, 0.0f,
    -0.5f,  0.5f,  0.5f,  1.0f, 0.0f,

     0.5f,  0.5f,  0.5f,  1.0f, 0.0f,
     0.5f,  0.5f, -0.5f,  1.0f, 1.0f,
     0.5f, -0.5f, -0.5f,  0.0f, 1.0f,
     0.5f, -0.5f, -0.5f,  0.0f, 1.0f,
     0.5f, -0.5f,  0.5f,  0.0f, 0.0f,
     0.5f,  0.5f,  0.5f,  1.0f, 0.0f,

    -0.5f, -0.5f, -0.5f,  0.0f, 1.0f,
     0.5f, -0.5f, -0.5f,  1.0f, 1.0f,
     0.5f, -0.5f,  0.5f,  1.0f, 0.0f,
     0.5f, -0.5f,  0.5f,  1.0f, 0.0f,
    -0.5f, -0.5f,  0.5f,  0.0f, 0.0f,
    -0.5f, -0.5f, -0.5f,  0.0f, 1.0f,

    -0.5f,  0.5f, -0.5f,  0.0f, 1.0f,
     0.5f,  0.5f, -0.5f,  1.0f, 1.0f,
     0.5f,  0.5f,  0.5f,  1.0f, 0.0f,
     0.5f,  0.5f,  0.5f,  1.0f, 0.0f,
    -0.5f,  0.5f,  0.5f,  0.0f, 0.0f,
    -0.5f,  0.5f, -0.5f,  0.0f, 1.0f
};

#endif // !VERTICES_H

