#ifndef VERTICES_H
#define VERTCES_H

//координаты вершин прямоугольника для текстуры + координаты текстуры
float verticesOriginal[] = {
	 1.0f,  1.0f, 0.0f,   1.0f, 0.0f, // верхний правый угол
	 1.0f, -1.0f, 0.0f,   1.0f, 1.0f, // нижний правый угол
	-1.0f, -1.0f, 0.0f,   0.0f, 1.0f, // нижний левый угол
	-1.0f,  1.0f, 0.0f,   0.0f, 0.0f  // верхний левый угол
};

//уменьшенное изображение в левом веррхнем углу
float verticesSmall[] = {
	 0.0f,  1.0f, 0.0f,  1.0f, 0.0f, // верхний край
	 0.0f,  0.0f, 0.0f,  1.0f, 1.0f, // центр
	-1.0f,  0.0f, 0.0f,  0.0f, 1.0f, // левый край
	-1.0f,  1.0f, 0.0f,  0.0f, 0.0f, // верхний левый угол
};

float verticesHalf1[] = {
     0.0f,  1.0f, 0.0f,	 1.0f, 0.0f, // верхний правый угол
     0.0f, -1.0f, 0.0f,	 1.0f, 1.0f, // нижний правый угол
    -1.0f, -1.0f, 0.0f,	 0.0f, 1.0f, // нижний левый угол
    -1.0f,  1.0f, 0.0f,	 0.0f, 0.0f, // верхний левый угол
     0.0f,  1.0f, 0.0f,	 1.0f, 0.0f, // верхний правый угол (повтор)
    -1.0f, -1.0f, 0.0f,	 0.0f, 1.0f  // нижний левый угол (повтор)
};

float verticesHalf2[] = {
    1.0f,  1.0f, 0.0f,	1.0f, 0.0f, // верхний левый угол
    1.0f, -1.0f, 0.0f,	1.0f, 1.0f, // нижний левый угол
    0.0f, -1.0f, 0.0f,	0.0f, 1.0f, // нижний правый угол
    0.0f,  1.0f, 0.0f,	0.0f, 0.0f, // верхний правый угол
    1.0f,  1.0f, 0.0f,	1.0f, 0.0f, // верхний левый угол (повтор)
    0.0f, -1.0f, 0.0f,	0.0f, 1.0f  // нижний правый угол (повтор)
};

float verticesHalfLeft[] = {
    // Позиции            // Текстурные координаты
    0.0f,  1.0f, 0.0f,    0.5f, 0.0f, // верхний правый угол
    0.0f, -1.0f, 0.0f,    0.5f, 1.0f, // нижний правый угол
   -1.0f, -1.0f, 0.0f,    0.0f, 1.0f, // нижний левый угол
   -1.0f,  1.0f, 0.0f,    0.0f, 0.0f, // верхний левый угол
    0.0f,  1.0f, 0.0f,    0.5f, 0.0f, // верхний правый угол (повтор)
   -1.0f, -1.0f, 0.0f,    0.0f, 1.0f  // нижний левый угол (повтор)
};

float verticesHalfRight[] = {
    // Позиции            // Текстурные координаты
    1.0f,  1.0f, 0.0f,    1.0f, 0.0f, // верхний левый угол
    1.0f, -1.0f, 0.0f,    1.0f, 1.0f, // нижний левый угол
    0.0f, -1.0f, 0.0f,    0.5f, 1.0f, // нижний правый угол
    0.0f,  1.0f, 0.0f,    0.5f, 0.0f, // верхний правый угол
    1.0f,  1.0f, 0.0f,    1.0f, 0.0f, // верхний левый угол (повтор)
    0.0f, -1.0f, 0.0f,    0.5f, 1.0f  // нижний правый угол (повтор)
};

float cubeVertices[] = {
    -0.5f, -0.5f, -0.5f,  0.0f, 1.0f,
     0.5f, -0.5f, -0.5f,  1.0f, 1.0f,
     0.5f,  0.5f, -0.5f,  1.0f, 0.0f,
     0.5f,  0.5f, -0.5f,  1.0f, 0.0f,
    -0.5f,  0.5f, -0.5f,  0.0f, 0.0f,
    -0.5f, -0.5f, -0.5f,  0.0f, 1.0f,

    -0.5f, -0.5f,  0.5f,  0.0f, 1.0f,
     0.5f, -0.5f,  0.5f,  1.0f, 1.0f,
     0.5f,  0.5f,  0.5f,  1.0f, 0.0f,
     0.5f,  0.5f,  0.5f,  1.0f, 0.0f,
    -0.5f,  0.5f,  0.5f,  0.0f, 0.0f,
    -0.5f, -0.5f,  0.5f,  0.0f, 1.0f,

    -0.5f,  0.5f,  0.5f,  1.0f, 0.0f,
    -0.5f,  0.5f, -0.5f,  1.0f, 1.0f,
    -0.5f, -0.5f, -0.5f,  0.0f, 1.0f,
    -0.5f, -0.5f, -0.5f,  0.0f, 1.0f,
    -0.5f, -0.5f,  0.5f,  0.0f, 0.0f,
    -0.5f,  0.5f,  0.5f,  1.0f, 0.0f,

     0.5f,  0.5f,  0.5f,  1.0f, 0.0f,
     0.5f,  0.5f, -0.5f,  1.0f, 1.0f,
     0.5f, -0.5f, -0.5f,  0.0f, 1.0f,
     0.5f, -0.5f, -0.5f,  0.0f, 1.0f,
     0.5f, -0.5f,  0.5f,  0.0f, 0.0f,
     0.5f,  0.5f,  0.5f,  1.0f, 0.0f,

    -0.5f, -0.5f, -0.5f,  0.0f, 1.0f,
     0.5f, -0.5f, -0.5f,  1.0f, 1.0f,
     0.5f, -0.5f,  0.5f,  1.0f, 0.0f,
     0.5f, -0.5f,  0.5f,  1.0f, 0.0f,
    -0.5f, -0.5f,  0.5f,  0.0f, 0.0f,
    -0.5f, -0.5f, -0.5f,  0.0f, 1.0f,

    -0.5f,  0.5f, -0.5f,  0.0f, 1.0f,
     0.5f,  0.5f, -0.5f,  1.0f, 1.0f,
     0.5f,  0.5f,  0.5f,  1.0f, 0.0f,
     0.5f,  0.5f,  0.5f,  1.0f, 0.0f,
    -0.5f,  0.5f,  0.5f,  0.0f, 0.0f,
    -0.5f,  0.5f, -0.5f,  0.0f, 1.0f
};

GLfloat fullScreenVertices[] = {

    // Первый прямоугольник (левый)
    -1.0f,  1.0f, 0.0f, 0.0f, 0.0f,  // верхний левый угол
    -1.0f, -1.0f, 0.0f, 0.0f, 1.0f,  // нижний левый угол
     0.0f, -1.0f, 0.0f, 1.0f, 1.0f,  // нижний центр

    -1.0f,  1.0f, 0.0f, 0.0f, 0.0f,  // верхний левый угол
     0.0f, -1.0f, 0.0f, 1.0f, 1.0f,  // нижний центр
     0.0f,  1.0f, 0.0f, 1.0f, 0.0f,  // верхний центр

     // Второй прямоугольник (правый)
      0.0f,  1.0f, 0.0f, 0.0f, 0.0f,  // верхний центр
      0.0f, -1.0f, 0.0f, 0.0f, 1.0f,  // нижний центр
      1.0f, -1.0f, 0.0f, 1.0f, 1.0f,  // нижний правый угол

      0.0f,  1.0f, 0.0f, 0.0f, 0.0f,  // верхний центр
      1.0f, -1.0f, 0.0f, 1.0f, 1.0f,  // нижний правый угол
      1.0f,  1.0f, 0.0f, 1.0f, 0.0f   // верхний правый угол
};

//float cubeVerticesMarker[] = {
//    -0.025f, -0.025f, -0.025f,  0.0f, 0.0f,
//     0.025f, -0.025f, -0.025f,  1.0f, 0.0f,
//     0.025f,  0.025f, -0.025f,  1.0f, 1.0f,
//     0.025f,  0.025f, -0.025f,  1.0f, 1.0f,
//    -0.025f,  0.025f, -0.025f,  0.0f, 1.0f,
//    -0.025f, -0.025f, -0.025f,  0.0f, 0.0f,
//
//    -0.025f, -0.025f,  0.025f,  0.0f, 0.0f,
//     0.025f, -0.025f,  0.025f,  1.0f, 0.0f,
//     0.025f,  0.025f,  0.025f,  1.0f, 1.0f,
//     0.025f,  0.025f,  0.025f,  1.0f, 1.0f,
//    -0.025f,  0.025f,  0.025f,  0.0f, 1.0f,
//    -0.025f, -0.025f,  0.025f,  0.0f, 0.0f,
//
//    -0.025f,  0.025f,  0.025f,  1.0f, 0.0f,
//    -0.025f,  0.025f, -0.025f,  1.0f, 1.0f,
//    -0.025f, -0.025f, -0.025f,  0.0f, 1.0f,
//    -0.025f, -0.025f, -0.025f,  0.0f, 1.0f,
//    -0.025f, -0.025f,  0.025f,  0.0f, 0.0f,
//    -0.025f,  0.025f,  0.025f,  1.0f, 0.0f,
//
//     0.025f,  0.025f,  0.025f,  1.0f, 0.0f,
//     0.025f,  0.025f, -0.025f,  1.0f, 1.0f,
//     0.025f, -0.025f, -0.025f,  0.0f, 1.0f,
//     0.025f, -0.025f, -0.025f,  0.0f, 1.0f,
//     0.025f, -0.025f,  0.025f,  0.0f, 0.0f,
//     0.025f,  0.025f,  0.025f,  1.0f, 0.0f,
//
//    -0.025f, -0.025f, -0.025f,  0.0f, 1.0f,
//     0.025f, -0.025f, -0.025f,  1.0f, 1.0f,
//     0.025f, -0.025f,  0.025f,  1.0f, 0.0f,
//     0.025f, -0.025f,  0.025f,  1.0f, 0.0f,
//    -0.025f, -0.025f,  0.025f,  0.0f, 0.0f,
//    -0.025f, -0.025f, -0.025f,  0.0f, 1.0f,
//
//    -0.025f,  0.025f, -0.025f,  0.0f, 1.0f,
//     0.025f,  0.025f, -0.025f,  1.0f, 1.0f,
//     0.025f,  0.025f,  0.025f,  1.0f, 0.0f,
//     0.025f,  0.025f,  0.025f,  1.0f, 0.0f,
//    -0.025f,  0.025f,  0.025f,  0.0f, 0.0f,
//    -0.025f,  0.025f, -0.025f,  0.0f, 1.0f
//};

float cubeVerticesMarker[] = {
    -0.125f, -0.125f, -0.125f,  0.0f, 0.0f,
     0.125f, -0.125f, -0.125f,  1.0f, 0.0f,
     0.125f,  0.125f, -0.125f,  1.0f, 1.0f,
     0.125f,  0.125f, -0.125f,  1.0f, 1.0f,
    -0.125f,  0.125f, -0.125f,  0.0f, 1.0f,
    -0.125f, -0.125f, -0.125f,  0.0f, 0.0f,

    -0.125f, -0.125f,  0.125f,  0.0f, 0.0f,
     0.125f, -0.125f,  0.125f,  1.0f, 0.0f,
     0.125f,  0.125f,  0.125f,  1.0f, 1.0f,
     0.125f,  0.125f,  0.125f,  1.0f, 1.0f,
    -0.125f,  0.125f,  0.125f,  0.0f, 1.0f,
    -0.125f, -0.125f,  0.125f,  0.0f, 0.0f,

    -0.125f,  0.125f,  0.125f,  1.0f, 0.0f,
    -0.125f,  0.125f, -0.125f,  1.0f, 1.0f,
    -0.125f, -0.125f, -0.125f,  0.0f, 1.0f,
    -0.125f, -0.125f, -0.125f,  0.0f, 1.0f,
    -0.125f, -0.125f,  0.125f,  0.0f, 0.0f,
    -0.125f,  0.125f,  0.125f,  1.0f, 0.0f,

     0.125f,  0.125f,  0.125f,  1.0f, 0.0f,
     0.125f,  0.125f, -0.125f,  1.0f, 1.0f,
     0.125f, -0.125f, -0.125f,  0.0f, 1.0f,
     0.125f, -0.125f, -0.125f,  0.0f, 1.0f,
     0.125f, -0.125f,  0.125f,  0.0f, 0.0f,
     0.125f,  0.125f,  0.125f,  1.0f, 0.0f,

    -0.125f, -0.125f, -0.125f,  0.0f, 1.0f,
     0.125f, -0.125f, -0.125f,  1.0f, 1.0f,
     0.125f, -0.125f,  0.125f,  1.0f, 0.0f,
     0.125f, -0.125f,  0.125f,  1.0f, 0.0f,
    -0.125f, -0.125f,  0.125f,  0.0f, 0.0f,
    -0.125f, -0.125f, -0.125f,  0.0f, 1.0f,

    -0.125f,  0.125f, -0.125f,  0.0f, 1.0f,
     0.125f,  0.125f, -0.125f,  1.0f, 1.0f,
     0.125f,  0.125f,  0.125f,  1.0f, 0.0f,
     0.125f,  0.125f,  0.125f,  1.0f, 0.0f,
    -0.125f,  0.125f,  0.125f,  0.0f, 0.0f,
    -0.125f,  0.125f, -0.125f,  0.0f, 1.0f
};

#endif // !VERTICES_H

